{
    "description": "Query data and manage databases,retention policies and users. https://docs.influxdata.com/influxdb/latest/tools/api/#query-string-parameters-1",
    "enabled": true,
    "entry_point": "lib/query.py",
    "name": "query",
    "pack": "influxdb",
    "parameters": {
        "chunked": {
            "default": 0,
            "description": "Returns points in streamed batches instead of in a single response. If set to a specific value, InfluxDB chunks responses by series or by that number of points.\n",
            "type": "integer"
        },
        "credentials": {
            "default": "default",
            "description": "Name of the credentials object to use from the config",
            "type": "string"
        },
        "database": {
            "description": "Sets the target database for the query. Required for database-dependent queries (most SELECT queries and SHOW queries require this parameter).\n",
            "type": "string"
        },
        "epoch": {
            "description": "Returns epoch timestamps with the specified precision [ns,u,ms,s,m,h]. By default, InfluxDB returns timestamps in RFC3339 format with nanosecond precision.\n",
            "type": "string"
        },
        "method": {
            "description": "Name of HTTP method to use for the call.\n GET - Use for all queries that start with: SELECT, SHOW\n       The only exceptions are SELECT queries that include an INTO clause.\n       Those SELECT queries require a POST request.\n POST - Use for all queries taht start with: ALTER, CREATE, DELETE, DROP, GRANT, KILL, REVOKE\n \nNote: We try to auto-detect this by checking the <query> parameter using .startswith().\n      Since this is not always perfect, we allow the user to override and specify their\n      own method.\n",
            "type": "string"
        },
        "password": {
            "description": "Password to authenticate with. Overrides the <credentials> parameter",
            "secret": true,
            "type": "string"
        },
        "port": {
            "description": "Port number to connect to InfluxDB on. Overrides the setting in the pack's config.",
            "type": "integer"
        },
        "query": {
            "description": "Query string in InfluxQL syntax: https://docs.influxdata.com/influxdb/latest/query_language/\n",
            "type": "string"
        },
        "server": {
            "description": "Hostname/IP address of the server. Overrides the setting in the pack's config.",
            "type": "string"
        },
        "ssl": {
            "description": "Use SSL/HTTPS. Overrides the setting in the pack's config.",
            "type": "boolean"
        },
        "username": {
            "description": "User to authenticate as. Overrides the <credentials> parameter",
            "type": "string"
        },
        "verify_ssl": {
            "description": "Verify remote host SSL certificates. Overrides the setting in the pack's config.",
            "type": "boolean"
        }
    },
    "runner_type": "python-script"
}
