{
    "description": null,
    "enabled": true,
    "entry_point": "run.py",
    "name": "rds_describe_orderable_db_instance_options",
    "pack": "aws",
    "parameters": {
        "DBInstanceClass": {
            "description": "The DB instance class filter value. Specify this parameter to show only the available offerings matching the specified DB instance class.",
            "type": "string"
        },
        "Engine": {
            "description": "The name of the engine to retrieve DB instance options for.",
            "required": true,
            "type": "string"
        },
        "EngineVersion": {
            "description": "The engine version filter value. Specify this parameter to show only the available offerings matching the specified engine version.",
            "type": "string"
        },
        "Filters": {
            "description": "This parameter is not currently supported.",
            "type": "array"
        },
        "LicenseModel": {
            "description": "The license model filter value. Specify this parameter to show only the available offerings matching the specified license model.",
            "type": "string"
        },
        "Marker": {
            "description": " An optional pagination token provided by a previous DescribeOrderableDBInstanceOptions request. If this parameter is specified, the response includes only records beyond the marker, up to the value specified by MaxRecords . ",
            "type": "string"
        },
        "MaxRecords": {
            "description": " The maximum number of records to include in the response. If more records exist than the specified MaxRecords value, a pagination token called a marker is included in the response so that the remaining results can be retrieved.  Default: 100 Constraints: Minimum 20, maximum 100.",
            "type": "integer"
        },
        "Vpc": {
            "description": "The VPC filter value. Specify this parameter to show only the available VPC or non-VPC offerings.",
            "type": "boolean"
        },
        "account_id": {
            "type": "string"
        },
        "action": {
            "default": "describe_orderable_db_instance_options",
            "immutable": true,
            "type": "string"
        },
        "cls": {
            "default": "rds",
            "type": "string"
        },
        "headers": {
            "type": "string"
        },
        "module_path": {
            "default": "boto3",
            "immutable": true,
            "type": "string"
        },
        "region": {
            "type": "string"
        }
    },
    "runner_type": "python-script"
}
