{
    "description": null,
    "enabled": true,
    "entry_point": "run.py",
    "name": "rds_restore_db_instance_to_point_in_time",
    "pack": "aws",
    "parameters": {
        "AutoMinorVersionUpgrade": {
            "description": "Indicates that minor version upgrades will be applied automatically to the DB instance during the maintenance window.",
            "type": "boolean"
        },
        "AvailabilityZone": {
            "description": "The EC2 Availability Zone that the database instance will be created in. Default: A random, system-chosen Availability Zone. Constraint: You cannot specify the AvailabilityZone parameter if the MultiAZ parameter is set to true. Example: us-east-1a ",
            "type": "string"
        },
        "CopyTagsToSnapshot": {
            "description": "True to copy all tags from the restored DB instance to snapshots of the DB instance; otherwise false. The default is false.",
            "type": "boolean"
        },
        "DBInstanceClass": {
            "description": "The compute and memory capacity of the Amazon RDS DB instance. Valid Values: db.t1.micro | db.m1.small | db.m1.medium | db.m1.large | db.m1.xlarge | db.m2.2xlarge | db.m2.4xlarge | db.m3.medium | db.m3.large | db.m3.xlarge | db.m3.2xlarge | db.m4.large | db.m4.xlarge | db.m4.2xlarge | db.m4.4xlarge | db.m4.10xlarge | db.r3.large | db.r3.xlarge | db.r3.2xlarge | db.r3.4xlarge | db.r3.8xlarge | db.t2.micro | db.t2.small | db.t2.medium | db.t2.large  Default: The same DBInstanceClass as the original DB instance.",
            "type": "string"
        },
        "DBName": {
            "description": "The database name for the restored DB instance.  This parameter is not used for the MySQL or MariaDB engines. ",
            "type": "string"
        },
        "DBSubnetGroupName": {
            "description": "The DB subnet group name to use for the new instance. Constraints: Must contain no more than 255 alphanumeric characters, periods, underscores, spaces, or hyphens. Must not be default. Example: mySubnetgroup ",
            "type": "string"
        },
        "Domain": {
            "description": "Specify the Active Directory Domain to restore the instance in.",
            "type": "string"
        },
        "DomainIAMRoleName": {
            "description": "Specify the name of the IAM role to be used when making API calls to the Directory Service.",
            "type": "string"
        },
        "Engine": {
            "description": "The database engine to use for the new instance. Default: The same as source Constraint: Must be compatible with the engine of the source  Valid Values: MySQL | mariadb | oracle-se1 | oracle-se | oracle-ee | sqlserver-ee | sqlserver-se | sqlserver-ex | sqlserver-web | postgres | aurora ",
            "type": "string"
        },
        "Iops": {
            "description": "The amount of Provisioned IOPS (input/output operations per second) to be initially allocated for the DB instance. Constraints: Must be an integer greater than 1000.  SQL Server  Setting the IOPS value for the SQL Server database engine is not supported.",
            "type": "integer"
        },
        "LicenseModel": {
            "description": "License model information for the restored DB instance. Default: Same as source.  Valid values: license-included | bring-your-own-license | general-public-license ",
            "type": "string"
        },
        "MultiAZ": {
            "description": "Specifies if the DB instance is a Multi-AZ deployment. Constraint: You cannot specify the AvailabilityZone parameter if the MultiAZ parameter is set to true.",
            "type": "boolean"
        },
        "OptionGroupName": {
            "description": "The name of the option group to be used for the restored DB instance. Permanent options, such as the TDE option for Oracle Advanced Security TDE, cannot be removed from an option group, and that option group cannot be removed from a DB instance once it is associated with a DB instance",
            "type": "string"
        },
        "Port": {
            "description": "The port number on which the database accepts connections. Constraints: Value must be 1150-65535  Default: The same port as the original DB instance.",
            "type": "integer"
        },
        "PubliclyAccessible": {
            "description": "Specifies the accessibility options for the DB instance. A value of true specifies an Internet-facing instance with a publicly resolvable DNS name, which resolves to a public IP address. A value of false specifies an internal instance with a DNS name that resolves to a private IP address. Default: The default behavior varies depending on whether a VPC has been requested or not. The following list shows the default behavior in each case.    Default VPC:true    VPC:false   If no DB subnet group has been specified as part of the request and the PubliclyAccessible value has not been set, the DB instance will be publicly accessible. If a specific DB subnet group has been specified as part of the request and the PubliclyAccessible value has not been set, the DB instance will be private.",
            "type": "boolean"
        },
        "RestoreTime": {
            "description": "The date and time to restore from. Valid Values: Value must be a time in Universal Coordinated Time (UTC) format Constraints:   Must be before the latest restorable time for the DB instance   Cannot be specified if UseLatestRestorableTime parameter is true   Example: 2009-09-07T23:45:00Z ",
            "type": "string"
        },
        "SourceDBInstanceIdentifier": {
            "description": "The identifier of the source DB instance from which to restore. Constraints:   Must be the identifier of an existing database instance   Must contain from 1 to 63 alphanumeric characters or hyphens   First character must be a letter   Cannot end with a hyphen or contain two consecutive hyphens  ",
            "required": true,
            "type": "string"
        },
        "StorageType": {
            "description": "Specifies the storage type to be associated with the DB instance.  Valid values: standard | gp2 | io1   If you specify io1, you must also include a value for the Iops parameter.   Default: io1 if the Iops parameter is specified; otherwise standard ",
            "type": "string"
        },
        "Tags": {
            "description": "",
            "type": "array"
        },
        "TargetDBInstanceIdentifier": {
            "description": "The name of the new database instance to be created. Constraints:   Must contain from 1 to 63 alphanumeric characters or hyphens   First character must be a letter   Cannot end with a hyphen or contain two consecutive hyphens  ",
            "required": true,
            "type": "string"
        },
        "TdeCredentialArn": {
            "description": "The ARN from the Key Store with which to associate the instance for TDE encryption.",
            "type": "string"
        },
        "TdeCredentialPassword": {
            "description": "The password for the given ARN from the Key Store in order to access the device.",
            "type": "string"
        },
        "UseLatestRestorableTime": {
            "description": " Specifies whether (true) or not (false) the DB instance is restored from the latest backup time.  Default: false  Constraints: Cannot be specified if RestoreTime parameter is provided.",
            "type": "boolean"
        },
        "action": {
            "default": "restore_db_instance_to_point_in_time",
            "immutable": true,
            "type": "string"
        },
        "cls": {
            "default": "rds",
            "type": "string"
        },
        "headers": {
            "type": "string"
        },
        "module_path": {
            "default": "boto3",
            "immutable": true,
            "type": "string"
        }
    },
    "runner_type": "python-script"
}
