{
    "description": null,
    "enabled": true,
    "entry_point": "run.py",
    "name": "redshift_create_event_subscription",
    "pack": "aws",
    "parameters": {
        "Enabled": {
            "description": "A Boolean value; set to true to activate the subscription, set to false to create the subscription but not active it. ",
            "type": "boolean"
        },
        "EventCategories": {
            "description": "Specifies the Amazon Redshift event categories to be published by the event notification subscription. Values: Configuration, Management, Monitoring, Security",
            "type": "array"
        },
        "Severity": {
            "description": "Specifies the Amazon Redshift event severity to be published by the event notification subscription. Values: ERROR, INFO",
            "type": "string"
        },
        "SnsTopicArn": {
            "description": "The Amazon Resource Name (ARN) of the Amazon SNS topic used to transmit the event notifications. The ARN is created by Amazon SNS when you create a topic and subscribe to it.",
            "required": true,
            "type": "string"
        },
        "SourceIds": {
            "description": "A list of one or more identifiers of Amazon Redshift source objects. All of the objects must be of the same type as was specified in the source type parameter. The event subscription will return only events generated by the specified objects. If not specified, then events are returned for all objects within the source type specified. Example: my-cluster-1, my-cluster-2 Example: my-snapshot-20131010",
            "type": "array"
        },
        "SourceType": {
            "description": "The type of source that will be generating the events. For example, if you want to be notified of events generated by a cluster, you would set this parameter to cluster. If this value is not specified, events are returned for all Amazon Redshift objects in your AWS account. You must specify a source type in order to specify source IDs. Valid values: cluster, cluster-parameter-group, cluster-security-group, and cluster-snapshot.",
            "type": "string"
        },
        "SubscriptionName": {
            "description": "The name of the event subscription to be created. Constraints:   Cannot be null, empty, or blank.   Must contain from 1 to 255 alphanumeric characters or hyphens.   First character must be a letter.   Cannot end with a hyphen or contain two consecutive hyphens.  ",
            "required": true,
            "type": "string"
        },
        "Tags": {
            "description": "A list of tag instances.",
            "type": "array"
        },
        "account_id": {
            "type": "string"
        },
        "action": {
            "default": "create_event_subscription",
            "immutable": true,
            "type": "string"
        },
        "cls": {
            "default": "redshift",
            "type": "string"
        },
        "headers": {
            "type": "string"
        },
        "module_path": {
            "default": "boto3",
            "immutable": true,
            "type": "string"
        },
        "region": {
            "type": "string"
        }
    },
    "runner_type": "python-script"
}
